In [1]:
n=int(input('입력받을 정수:'))

total=0
for i in range(1,n+1):
    if (i%2==0):
        total+=i
        
print(total)

입력받을 정수:27
182

In [1]:
i=0
while i<=100:
    if i%6==0:
        print(i)
    i+=1

0
6
12
18
24
30
36
42
48
54
60
66
72
78
84
90
96

In [4]:
n=0
x=1
while n<20:
    if (x%5==0)&(x%7==0)&(x%11==0):
        print(x)
        n+=1
    x+=1

385
770
1155
1540
1925
2310
2695
3080
3465
3850
4235
4620
5005
5390
5775
6160
6545
6930
7315
7700

In [5]:
n

20

In [41]:
import numpy as np
import pandas as pd
np.random.seed(1886)
a=np.random.randint(1,20,size=10).tolist()

In [42]:
a.sort()
print(a)

[2, 4, 4, 5, 5, 7, 7, 10, 11, 14]

In [38]:
a

[7, 14, 2, 10, 5, 5, 4, 11, 4, 7]

In [32]:
a[0:5]

[2, 4, 4, 5, 5]

In [33]:
a[1:6:2]

[4, 5, 7]

In [19]:
a[-5::-1]

[5, 5, 10, 2, 14, 7]

In [20]:
a[:-3:-1]

[7, 4]

In [15]:
# problem 5
import numpy as np
import pandas as pd
np.random.seed(123)
df=pd.DataFrame(np.random.randint(1,21, size=(5,6)))
df.columns=['col1', 'col2', 'col3', 'col4', 'col5', 'col6']
df.index=['row1', 'row2', 'row3', 'row4', 'row5']
df

      col1  col2  col3  col4  col5  col6
row1    14     3     3     7    18    20
row2    11     2     1    18    16    10
row3     1    15     1    16    20    15
row4     5     1    17     5    18     4
row5     3     8     3    16    17     8

In [22]:
a=df.iloc[-3,:].tolist().sort()
print(a)

None

In [24]:
df.loc[['row2', 'row3']]

      col1  col2  col3  col4  col5  col6
row2    11     2     1    18    16    10
row3     1    15     1    16    20    15

In [28]:
df.loc[:,['col4', 'col5']]

      col4  col5
row1     7    18
row2    18    16
row3    16    20
row4     5    18
row5    16    17

In [29]:
df.loc[['row3'],['col6']]

      col6
row3    15

In [32]:
df2=df[df['col1']>5].loc[:,['col2','col3']]
df2

      col2  col3
row1     3     3
row2     2     1

In [36]:
def Max1(list):
    maxx= 0
    for i in range(len(list)):
        if maxx < list[i]:
            maxx = list[i]
    return list.index(maxx)

def max2(list):
    return list.index(max(list))

def myodd(list):
    a=[]
    for i in range(len(list)):
        if list[i]%2!=0:
            a.append(list[i])
    return a

In [39]:
Maxx([1,2,9,3,4,5,4,3])

2

In [54]:
def myodd(list):
    a=[]
    for i in range(len(list)):
        if list[i]%2!=0:
            a.append(list[i])
    return a

In [55]:
myodd([1,2,3,4,5])

[1, 3, 5]

In [57]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/agconti/kaggle-titanic/master/data/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [58]:
df[df['Survived']==0].head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [65]:
df[(df['PassengerId']>=5) & (df['Pclass']==3)].tail(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [1]:
for i in range(0,101):
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100

In [2]:
for i in range(0,101):
    if i%7==0:
        print(i)

0
7
14
21
28
35
42
49
56
63
70
77
84
91
98

In [3]:
for i in range(1,101):
    if (i%5==0) & (i%3!=0):
        print(i)

5
10
20
25
35
40
50
55
65
70
80
85
95
100

In [6]:
a=int(input('입력받을 정수:'))
sum=0
for i in range(a):
    if i%2==0:
        sum+=i
print(sum)

입력받을 정수:27
182

In [7]:
i=0
while i<100:
    if i%6==0:
        print(i)
    i+=1

0
6
12
18
24
30
36
42
48
54
60
66
72
78
84
90
96

In [9]:
n=0
while n<20:
    if (i%5==0)&(i%7==0)&(i%11==0):
        print(i)
        n+=1
    i+=1

385
770
1155
1540
1925
2310
2695
3080
3465
3850
4235
4620
5005
5390
5775
6160
6545
6930
7315
7700

In [22]:
import numpy as np
np.random.seed(1886)
a=np.random.randint(1,20,size=10).tolist()
a

[7, 14, 2, 10, 5, 5, 4, 11, 4, 7]

In [21]:
a[:5]

[7, 14, 2, 10, 5]

In [24]:
a[1:6:2]

[14, 10, 5]

In [25]:
a[-5::-1]

[5, 5, 10, 2, 14, 7]

In [26]:
a[:-3:-1]

[7, 4]

In [33]:
import numpy as np
import pandas as pd
np.random.seed(123)
a=np.random.randint(1,21,size=(5,6))
a=pd.DataFrame(a)
a.columns=['c1','c2','c3','c4','c5','c6']
a.index=['r1','r2','r3','r4','r5']
a

    c1  c2  c3  c4  c5  c6
r1  14   3   3   7  18  20
r2  11   2   1  18  16  10
r3   1  15   1  16  20  15
r4   5   1  17   5  18   4
r5   3   8   3  16  17   8

In [34]:
a.tail(3)

    c1  c2  c3  c4  c5  c6
r3   1  15   1  16  20  15
r4   5   1  17   5  18   4
r5   3   8   3  16  17   8

In [38]:
a.loc[['r2','r3']]

    c1  c2  c3  c4  c5  c6
r2  11   2   1  18  16  10
r3   1  15   1  16  20  15

In [40]:
a.loc[:,['c4','c5']]

    c4  c5
r1   7  18
r2  18  16
r3  16  20
r4   5  18
r5  16  17

In [41]:
a.loc['r3','c6']

15

In [43]:
a[a['c1']>5].loc[:,['c2','c3']]

    c2  c3
r1   3   3
r2   2   1

In [44]:
def my_max(x,y):
    if x>=y:
        return x
    else:
        return y

In [45]:
my_max(1,2)

2

In [46]:
my_max(2,1)

2

In [47]:
def myodd(list):
    for i in range(len(list)):
        if list[i]%2!=0:
            print(list[i])

In [48]:
myodd([1,2,3,4,5])

1
3
5

In [50]:
import numpy as np
np.random.seed(777)
np.random.randint(1,101,size=20).tolist()

[48,
 60,
 39,
 88,
 50,
 72,
 30,
 40,
 90,
 47,
 25,
 40,
 19,
 14,
 15,
 33,
 92,
 66,
 83,
 85]

In [52]:
import pandas as pd
a=pd.read_csv("https://raw.githubusercontent.com/agconti/kaggle-titanic/master/data/train.csv")
a.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
a[a['Survived']==0].head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [54]:
a[(a['PassengerId']>=5)&(a['Pclass']==3)].tail(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q